app/Http/Livewire/GamesHistoryDatatables.php

select * from `games` where `id` = 10 limit 1
select `users`.*, `game_players`.`game_id` as `pivot_game_id`, `game_players`.`user_id` as `pivot_user_id`, `game_players`.`result` as `pivot_result` from `users` inner join `game_players` on `users`.`id` = `game_players`.`user_id` where `game_players`.`game_id` = 10
---
    public function gameResult($id)
    {
        if (!$id)
        {
            return "-";
        }

        $game = Game::query()->where('id', $id)->first()->users()->get();