app/Http/Controllers/AccountController.php

select * from `game_players` where `user_id` = 1
select * from `users` limit 1
---
    public function login()
    {
        $games = Game::with('users');
        $games->whereHas('gamePlayers', function ($query) {
            $query->where('user_id', auth()->user()->id)
                  ->orWhere('created_by',  auth()->user()->id);
        })->where('status', '!=', 'Terminé')
          ->get();